regression2/t_collate_distinct_range_utf8mb4_unicode/mysql-5.7.25/sysbench.ro.64.res
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 64
Report intermediate results every 3 second(s)
Random number generator seed is 0 and will be ignored

Forcing shutdown in 160 seconds

Threads started!

[   3s] threads: 64, tps: 10212.04, reads: 102230.07, writes: 0.00, response time: 9.34ms (95%), errors: 0.00, reconnects:  0.00
[   6s] threads: 64, tps: 10283.34, reads: 102834.06, writes: 0.00, response time: 9.25ms (95%), errors: 0.00, reconnects:  0.00
[   9s] threads: 64, tps: 10288.00, reads: 102874.00, writes: 0.00, response time: 9.30ms (95%), errors: 0.00, reconnects:  0.00
[  12s] threads: 64, tps: 10302.00, reads: 103027.01, writes: 0.00, response time: 9.32ms (95%), errors: 0.00, reconnects:  0.00
[  15s] threads: 64, tps: 10283.33, reads: 102816.62, writes: 0.00, response time: 9.30ms (95%), errors: 0.00, reconnects:  0.00
[  18s] threads: 64, tps: 10271.35, reads: 102723.80, writes: 0.00, response time: 9.26ms (95%), errors: 0.00, reconnects:  0.00
[  21s] threads: 64, tps: 10270.34, reads: 102703.69, writes: 0.00, response time: 9.28ms (95%), errors: 0.00, reconnects:  0.00
[  24s] threads: 64, tps: 10259.66, reads: 102589.30, writes: 0.00, response time: 9.28ms (95%), errors: 0.00, reconnects:  0.00
[  27s] threads: 64, tps: 10278.33, reads: 102794.92, writes: 0.00, response time: 9.27ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 64, tps: 10285.00, reads: 102841.99, writes: 0.00, response time: 9.26ms (95%), errors: 0.00, reconnects:  0.00
[  33s] threads: 64, tps: 10256.00, reads: 102562.64, writes: 0.00, response time: 9.27ms (95%), errors: 0.00, reconnects:  0.00
[  36s] threads: 64, tps: 10280.34, reads: 102789.36, writes: 0.00, response time: 9.26ms (95%), errors: 0.00, reconnects:  0.00
[  39s] threads: 64, tps: 10271.33, reads: 102732.64, writes: 0.00, response time: 9.29ms (95%), errors: 0.00, reconnects:  0.00
[  42s] threads: 64, tps: 10283.98, reads: 102821.15, writes: 0.00, response time: 9.27ms (95%), errors: 0.00, reconnects:  0.00
[  45s] threads: 64, tps: 10267.69, reads: 102697.24, writes: 0.00, response time: 9.25ms (95%), errors: 0.00, reconnects:  0.00
[  48s] threads: 64, tps: 10283.67, reads: 102830.33, writes: 0.00, response time: 9.26ms (95%), errors: 0.00, reconnects:  0.00
[  51s] threads: 64, tps: 10274.67, reads: 102743.69, writes: 0.00, response time: 9.30ms (95%), errors: 0.00, reconnects:  0.00
[  54s] threads: 64, tps: 10279.33, reads: 102792.97, writes: 0.00, response time: 9.28ms (95%), errors: 0.00, reconnects:  0.00
[  57s] threads: 64, tps: 10270.93, reads: 102711.27, writes: 0.00, response time: 9.29ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 64, tps: 10281.74, reads: 102815.41, writes: 0.00, response time: 9.31ms (95%), errors: 0.00, reconnects:  0.00
[  63s] threads: 64, tps: 10290.67, reads: 102922.68, writes: 0.00, response time: 9.31ms (95%), errors: 0.00, reconnects:  0.00
[  66s] threads: 64, tps: 10276.00, reads: 102742.00, writes: 0.00, response time: 9.27ms (95%), errors: 0.00, reconnects:  0.00
[  69s] threads: 64, tps: 10263.67, reads: 102647.33, writes: 0.00, response time: 9.19ms (95%), errors: 0.00, reconnects:  0.00
[  72s] threads: 64, tps: 10261.33, reads: 102620.98, writes: 0.00, response time: 9.16ms (95%), errors: 0.00, reconnects:  0.00
[  75s] threads: 64, tps: 10276.00, reads: 102752.66, writes: 0.00, response time: 9.20ms (95%), errors: 0.00, reconnects:  0.00
[  78s] threads: 64, tps: 10267.33, reads: 102681.33, writes: 0.00, response time: 9.20ms (95%), errors: 0.00, reconnects:  0.00
[  81s] threads: 64, tps: 10272.33, reads: 102727.67, writes: 0.00, response time: 9.27ms (95%), errors: 0.00, reconnects:  0.00
[  84s] threads: 64, tps: 10264.67, reads: 102627.33, writes: 0.00, response time: 9.21ms (95%), errors: 0.00, reconnects:  0.00
[  87s] threads: 64, tps: 10255.00, reads: 102555.00, writes: 0.00, response time: 9.17ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 64, tps: 10270.00, reads: 102700.03, writes: 0.00, response time: 9.25ms (95%), errors: 0.00, reconnects:  0.00
[  93s] threads: 64, tps: 10241.00, reads: 102419.30, writes: 0.00, response time: 9.20ms (95%), errors: 0.00, reconnects:  0.00
[  96s] threads: 64, tps: 10270.00, reads: 102683.35, writes: 0.00, response time: 9.16ms (95%), errors: 0.00, reconnects:  0.00
[  99s] threads: 64, tps: 10260.34, reads: 102620.75, writes: 0.00, response time: 9.19ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            10271790
        write:                           0
        other:                           2054358
        total:                           12326148
    transactions:                        1027179 (10271.34 per sec.)
    read/write requests:                 10271790 (102713.35 per sec.)
    other operations:                    2054358 (20542.67 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0044s
    total number of events:              1027179
    total time taken by event execution: 6398.2233s
    response time:
         min:                                  2.73ms
         avg:                                  6.23ms
         max:                                 75.68ms
         approx.  95 percentile:               9.27ms

Threads fairness:
    events (avg/stddev):           16049.6719/1399.82
    execution time (avg/stddev):   99.9722/0.01